In [48]:
#Q1: Find the top 5 products by total sales (Net Sales).
import pandas as pd

In [49]:
data=pd.read_csv("C:\\Users\\Himanshu\\OneDrive\\Desktop\\Summer Internship 2025\\Pandas\\sales_data_500.csv")
data.columns

Index(['Date', 'Customer Name', 'Region', 'Category', 'Product',
       'Quantity Sold', 'Unit Price', 'Total Price', 'Discount', 'Net Sales',
       'Payment Mode'],
      dtype='object')

In [50]:
top_5=data.groupby('Product')['Net Sales'].sum().sort_values(ascending=False).head()
top_5

Product
Non-Fiction      52405.52
Comics           50612.78
Board Game       45833.81
Action Figure    41478.24
Cookware         41032.68
Name: Net Sales, dtype: float64

In [51]:
#Q2: Get the region with the highest average discount per order.
data.columns

Index(['Date', 'Customer Name', 'Region', 'Category', 'Product',
       'Quantity Sold', 'Unit Price', 'Total Price', 'Discount', 'Net Sales',
       'Payment Mode'],
      dtype='object')

In [52]:
data.groupby('Region')['Discount'].mean().sort_values(ascending=False).head(1)

Region
West    240.227829
Name: Discount, dtype: float64

In [53]:
#Q3: Extract month from 'Date' and find total sales per month.

data['Month']=pd.to_datetime(data['Date']).dt.month
monthly_sales=data.groupby('Month')['Net Sales'].sum()
monthly_sales

Month
1     62759.40
2     40027.82
3     59276.48
4     51967.59
5     75712.20
6     46776.18
7     60229.14
8     22605.51
9     52499.23
10    62067.16
11    38831.58
12    61877.74
Name: Net Sales, dtype: float64

In [54]:
#Q4: Get total quantity sold by each product category.
data.columns

Index(['Date', 'Customer Name', 'Region', 'Category', 'Product',
       'Quantity Sold', 'Unit Price', 'Total Price', 'Discount', 'Net Sales',
       'Payment Mode', 'Month'],
      dtype='object')

In [55]:
data.groupby('Category')['Quantity Sold'].sum()

Category
Books             714
Clothing          564
Electronics       570
Home & Kitchen    454
Toys              596
Name: Quantity Sold, dtype: int64

In [56]:
#Q5: Count how many unique products were sold in each category.
data.groupby('Category')['Product'].nunique()

Category
Books             4
Clothing          4
Electronics       4
Home & Kitchen    4
Toys              4
Name: Product, dtype: int64

In [62]:
# #Q6: Find the most common payment mode in each region.

data.groupby('Region')['Payment Mode'].agg(lambda x:x.mode()[0])

# data.groupby('Region')['Payment Mode'].agg(lambda x:x.mode()).iloc[0]

Region
East     Debit Card
North           UPI
South           UPI
West            UPI
Name: Payment Mode, dtype: object

In [ ]:
#Q7: Calculate the average discount percentage for each product.
data.columns

Index(['Date', 'Customer Name', 'Region', 'Category', 'Product',
       'Quantity Sold', 'Unit Price', 'Total Price', 'Discount', 'Net Sales',
       'Payment Mode'],
      dtype='object')

In [ ]:
data['Discount %'] = (data['Discount'] / data['Total Price']) * 100

avg_discount = data.groupby('Product')['Discount %'].mean()
print(avg_discount)

Product
Action Figure    14.723067
Biography        13.112614
Blender          14.466039
Board Game       13.727034
Camera           16.907377
Comics           13.711644
Cookware         14.396278
Doll             16.746377
Dress            18.935381
Fiction          12.812109
Headphones       14.394025
Jacket           13.586356
Jeans            14.822704
Laptop           16.441650
Mixer            14.562095
Non-Fiction      16.295903
Puzzle           15.431320
Smartphone       14.002743
T-shirt          13.762615
Toaster          15.592909
Name: Discount %, dtype: float64

In [69]:
#Q8: Filter records where quantity sold is more than 5 and payment mode is ‘UPI’.

data[(data['Quantity Sold']>5) & (data['Payment Mode']=='UPI')].head()

,Date,Customer Name,Region,Category,Product,Quantity Sold,Unit Price,Total Price,Discount,Net Sales,Payment Mode,Month,profit,Profit
15,2024-11-16,John Montgomery,South,Home & Kitchen,Blender,8,195.21,1561.68,263.55,1298.13,UPI,11,129.813,129.813
16,2025-02-26,Lisa Davis,South,Books,Fiction,10,14.46,144.60,16.27,128.33,UPI,2,12.833,12.833
22,2024-12-03,Gloria Bowers,South,Books,Comics,9,260.01,2340.09,199.75,2140.34,UPI,12,214.034,214.034
48,2025-01-06,Nancy Marsh,West,Books,Biography,9,469.29,4223.61,1209.56,3014.05,UPI,1,301.405,301.405
55,2025-05-01,Maureen Lee,South,Clothing,Jeans,8,460.62,3684.96,448.54,3236.42,UPI,5,323.642,323.642

In [74]:
#Q9: Create a new column 'Profit' assuming profit is 10% of Net Sales.
data['Profit']=data['Net Sales']*0.10
print(data[['Product','Net Sales','Profit']].head())

       Product  Net Sales   Profit
0   Headphones     651.77   65.177
1   Board Game     264.99   26.499
2   Board Game    1329.78  132.978
3      T-shirt     181.29   18.129
4  Non-Fiction    2970.80  297.080

In [ ]:
#Q10: Get total sales per product per region using pivot table.

In [81]:
#Q11: Sort data by Net Sales and show top 10 entries.
top_10=data['Net Sales'].sort_values(ascending=False).head(10)
top_10

33     4471.02
289    4106.98
183    4025.32
140    4004.30
162    3971.40
448    3950.53
5      3872.24
394    3852.07
270    3839.66
483    3833.07
Name: Net Sales, dtype: float64

In [95]:
#Q12: Replace all payment mode values "Cash" with "Offline Cash".

data['Payment Mode'] = data['Payment Mode'].replace('Cash', 'Offline Cash')
data.head()

,Date,Customer Name,Region,Category,Product,Quantity Sold,Unit Price,Total Price,Discount,Net Sales,Payment Mode,Month,profit,Profit
0,2025-01-12,Karl Beck,West,Electronics,Headphones,10,80.66,806.60,154.83,651.77,Net Banking,1,65.177,65.177
1,2024-09-02,Carol Torres,North,Toys,Board Game,1,303.01,303.01,38.02,264.99,UPI,9,26.499,26.499
2,2024-10-16,Margaret Jackson,South,Toys,Board Game,10,142.89,1428.90,99.12,1329.78,Credit Card,10,132.978,132.978
3,2025-04-02,Eric Melendez,North,Clothing,T-shirt,1,244.23,244.23,62.94,181.29,UPI,4,18.129,18.129
4,2024-11-20,Janice Ramos,North,Books,Non-Fiction,9,436.63,3929.67,958.87,2970.80,Net Banking,11,297.080,297.080

In [96]:
data['Payment Mode'].unique()

array(['Net Banking', 'UPI', 'Credit Card', 'Offline Cash', 'Debit Card'],
      dtype=object)

In [98]:
#Q13: Find customer who made the highest net purchase.
cust_highest=data.groupby('Customer Name')['Net Sales'].sum().sort_values(ascending=False).head(5)
cust_highest

Customer Name
David Smith       6335.87
Daniel Jackson    4471.02
Michael Owens     4106.98
Terry Henry       4025.32
Candace Foster    3971.40
Name: Net Sales, dtype: float64

In [ ]:
#Q14: Check for any missing values in dataset.

# data.isnull().sum()
data.isna().sum() ## count missing values

Date             0
Customer Name    0
Region           0
Category         0
Product          0
Quantity Sold    0
Unit Price       0
Total Price      0
Discount         0
Net Sales        0
Payment Mode     0
Month            0
profit           0
Profit           0
dtype: int64

In [ ]:
# Q16: Create Category-wise summary report (count,mean,total sales)
## agg() in Pandas automatically interprets strings like 'sum', 'mean', 'count' as function names.

data.groupby('Category')['Net Sales'].agg(['mean','count'])

                       mean  count
Category
Books           1457.288214    112
Clothing        1205.697961    103
Electronics     1123.541789     95
Home & Kitchen  1083.593908     87
Toys            1419.589515    103

In [105]:
# Q17: Filter data for 'South' region and unit price >200, then sort by discount
data2=data[(data['Region']=='South') & (data['Unit Price']>200)]
data2['Discount'].sort_values(ascending=False)

203    1266.71
426    1163.07
69     1106.91
389     882.88
492     843.00
        ...
394      21.35
413      21.18
366      14.56
177      13.04
237       3.41
Name: Discount, Length: 74, dtype: float64

In [ ]:
# Q18: Find out the average quantity and average net sales grouped by category and Payment mode
# Q19: Calculate total discount given in the last 3 months of dataset
# Q20: Generate product-wise percentage contribution to total net sales